Modul 7/PRAK701/app/Controllers/BukuController.php

    public function index()
    {
      $books = new BookModel();
      $data['buku'] = $books->findAll(); echo view('admin_list_buku', $data);
---
SELECT *
FROM `buku`

    public function edit($id)
    {
      $books = new BookModel();
      $data['buku'] = $books->where('id', $id)->first();
---
SELECT *
FROM `buku`
WHERE `id` = '2'
 LIMIT 1

    public function delete($id)
    {
      $buku = new BookModel();
      $buku->delete($id);
---
DELETE FROM `buku`
WHERE `id` IN ('2')